In [1]:
import pandas as pd

In [2]:
csv_df = pd.read_csv("./used/sales_data_sample.csv", encoding="latin1")
json_df = pd.read_json("./used/sample_Data.json")
xlsx_df = pd.read_excel("./used/SampleSuperstore.xlsx")

print(csv_df, json_df, xlsx_df)

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2823 rows x 25 columns]     id                                               name  \
0    1                                    Apple iPhone 12
1    2                                 Samsung Galaxy S21
2    3                                 Sony PlayStation 5
3    4                  LG OLED55CXPUA 55-inch 4K OLED TV
4    5        Bose QuietComfort 35 II Wireless Headphones
5    6                          Fitbit Versa 3 Smartwatch
6    7                             KitchenAid Stand Mixer
7    8                 Dyson V11 Absolute Cordless Vacuum
8    9                         Ninja Foodi Smart XL Grill
9   10                    Canon EOS Rebel T8i DSLR Camera
10  11                                  Apple AirPods Pro
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description    price  \
0   The Apple iPhone 12 features a 6.1-inch Super ...   999.00
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00
2   The Sony PlayStation 5 features an AMD Zen 2-b...   499.99
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99
4   The Bose QuietComfort 35 II Wireless Headphone...   299.00
5   The Fitbit Versa 3 Smartwatch features a built...   229.95
6   The KitchenAid Stand Mixer features a 5-quart ...   399.99
7   The Dyson V11 Absolute Cordless Vacuum feature...   699.99
8   The Ninja Foodi Smart XL Grill features 6-in-1...   279.99
9   The Canon EOS Rebel T8i DSLR Camera features a...   899.00
10  The Apple AirPods Pro feature active noise can...   249.00
11  The Bose QuietComfort 35 II Wireless Headphone...   299.00
12  The Fitbit Charge 4 Fitness Tracker features G...   129.95
13  The Samsung Galaxy Watch3 features a rotating ...   399.99
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...   349.99
15  The Breville Barista Express Espresso Machine ...   699.95
16  The Keurig K-Elite Coffee Maker features a str...   169.99
17  The iRobot Roomba i7+ Robot Vacuum features au...   799.99
18  The Ninja Foodi Digital Air Fry Oven features ...   209.99
19  The Cuisinart ICE-70 Ice Cream Maker features ...   139.99

           category                                              image
0       Electronics  https://www.apple.com/newsroom/images/product/...
1       Electronics  https://images.samsung.com/is/image/samsung/p6...
2       Electronics  https://www.sony.com/image/44baa604124b770c824...
3       Electronics  https://www.lg.com/us/images/tvs/md07501804/ga...
4       Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
5       Electronics  https://www.fitbit.com/global/content/dam/fitb...
6    Home & Kitchen  https://www.kitchenaid.com/content/dam/global/...
7   Home Appliances  https://www.dysoncanada.ca/dam/dyson/images/pr...
8    Home & Kitchen  https://www.ninjakitchen.com/medias/Ninja-OP50...
9       Electronics  https://www.canon.com.au/-/media/images/produc...
10      Electronics  https://www.apple.com/v/airpods-pro/b/images/m...
11      Electronics  https://assets.bose.com/content/dam/Bose_DAM/W...
12      Electronics  https://www.fitbit.com/global/content/dam/fitb...
13      Electronics  https://images.samsung.com/is/image/samsung/as...
14      Electronics  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15   Home & Kitchen  https://www.breville.com/content/dam/breville/...
16   Home & Kitchen  https://www.keurig.com/content/dam/global-ecom...
17   Home & Kitchen  https://store.irobot.com/default/i7-vacuuming-...
18   Home & Kitchen  https://www.ninjakitchen.com/static/img/produc...
19   Home & Kitchen  https://www.cuisinart.com/share/images/product...         Row ID        Order ID Order Date  Ship Date       Ship Mode  \
0          1  CA-2016-152156 2016-11-08 2016-11-11    Second Class
1          2  CA-2016-152156 2016-11-08 2016-11-11    Second Class
2          3  CA-2016-138688 2016-06-12 2016-06-16    Second Class
3          4  US-2015-108966 2015-10-11 2015-10-18  Standard Class
4          5  US-2015-108966 2015-10-11 2015-10-18  Standard Class
...      ...             ...        ...        ...             ...
9989    9990  CA-2014-110422 2014-01-21 2014-01-23    Second Class
9990    9991  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9991    9992  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9992    9993  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9993    9994  CA-2017-119914 2017-05-04 2017-05-09    Second Class

     Customer ID     Customer Name    Segment        Country             City  \
0       CG-12520       Claire Gute   Consumer  United States        Henderson
1       CG-12520       Claire Gute   Consumer  United States        Henderson
2       DV-13045   Darrin Van Huff  Corporate  United States      Los Angeles
3       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
4       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
...          ...               ...        ...            ...              ...
9989    TB-21400  Tom Boeckenhauer   Consumer  United States            Miami
9990    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9991    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9992    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9993    CC-12220      Chris Cortes   Consumer  United States      Westminster

      ... Postal Code  Region       Product ID         Category Sub-Category  \
0     ...       42420   South  FUR-BO-10001798        Furniture    Bookcases
1     ...       42420   South  FUR-CH-10000454        Furniture       Chairs
2     ...       90036    West  OFF-LA-10000240  Office Supplies       Labels
3     ...       33311   South  FUR-TA-10000577        Furniture       Tables
4     ...       33311   South  OFF-ST-10000760  Office Supplies      Storage
...   ...         ...     ...              ...              ...          ...
9989  ...       33180   South  FUR-FU-10001889        Furniture  Furnishings
9990  ...       92627    West  FUR-FU-10000747        Furniture  Furnishings
9991  ...       92627    West  TEC-PH-10003645       Technology       Phones
9992  ...       92627    West  OFF-PA-10004041  Office Supplies        Paper
9993  ...       92683    West  OFF-AP-10002684  Office Supplies   Appliances

                                           Product Name     Sales  Quantity  \
0                     Bush Somerset Collection Bookcase  261.9600         2
1     Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400         3
2     Self-Adhesive Address Labels for Typewriters b...   14.6200         2
3         Bretford CR4500 Series Slim Rectangular Table  957.5775         5
4                        Eldon Fold 'N Roll Cart System   22.3680         2
...                                                 ...       ...       ...
9989                             Ultra Door Pull Handle   25.2480         3
9990  Tenex B1-RE Series Chair Mats for Low Pile Car...   91.9600         2
9991                              Aastra 57i VoIP phone  258.5760         2
9992  It's Hot Message Books with Stickers, 2 3/4" x 5"   29.6000         4
9993  Acco 7-Outlet Masterpiece Power Center, Wihtou...  243.1600         2

      Discount    Profit
0         0.00   41.9136
1         0.00  219.5820
2         0.00    6.8714
3         0.45 -383.0310
4         0.20    2.5164
...        ...       ...
9989      0.20    4.1028
9990      0.00   15.6332
9991      0.20   19.3932
9992      0.00   13.3200
9993      0.00   72.9480

[9994 rows x 21 columns]

In [3]:
custom_data = {
    "Name": ["Ayush", "Priya", "Gourish"],
    "Age":[21, 19, 20],
    "Place":["Jahannum", "Jashpur", "Khonga"]
}

custom_df = pd.DataFrame(custom_data)
print(custom_df)

      Name  Age     Place
0    Ayush   21  Jahannum
1    Priya   19   Jashpur
2  Gourish   20    Khonga

In [4]:
custom_df.to_csv("./created/output.csv", index=False)
custom_df.to_excel("./created/output.xlsx", index=False)
custom_df.to_json("./created/output.json", index=False)

In [5]:
# Display top 10 rows
df = pd.read_json("./used/sample_Data.json")

print(df.head(6))
print(df.tail(9))

   id                                         name  \
0   1                              Apple iPhone 12
1   2                           Samsung Galaxy S21
2   3                           Sony PlayStation 5
3   4            LG OLED55CXPUA 55-inch 4K OLED TV
4   5  Bose QuietComfort 35 II Wireless Headphones
5   6                    Fitbit Versa 3 Smartwatch

                                         description    price     category  \
0  The Apple iPhone 12 features a 6.1-inch Super ...   999.00  Electronics
1  The Samsung Galaxy S21 features a 6.2-inch Dyn...   799.00  Electronics
2  The Sony PlayStation 5 features an AMD Zen 2-b...   499.99  Electronics
3  The LG OLED55CXPUA 55-inch 4K OLED TV features...  1599.99  Electronics
4  The Bose QuietComfort 35 II Wireless Headphone...   299.00  Electronics
5  The Fitbit Versa 3 Smartwatch features a built...   229.95  Electronics

                                               image
0  https://www.apple.com/newsroom/images/product/...
1  https://images.samsung.com/is/image/samsung/p6...
2  https://www.sony.com/image/44baa604124b770c824...
3  https://www.lg.com/us/images/tvs/md07501804/ga...
4  https://assets.bose.com/content/dam/Bose_DAM/W...
5  https://www.fitbit.com/global/content/dam/fitb...
    id                                               name  \
11  12        Bose QuietComfort 35 II Wireless Headphones
12  13                    Fitbit Charge 4 Fitness Tracker
13  14                              Samsung Galaxy Watch3
14  15  Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15  16          Breville Barista Express Espresso Machine
16  17                        Keurig K-Elite Coffee Maker
17  18                     iRobot Roomba i7+ Robot Vacuum
18  19                   Ninja Foodi Digital Air Fry Oven
19  20                   Cuisinart ICE-70 Ice Cream Maker

                                          description   price        category  \
11  The Bose QuietComfort 35 II Wireless Headphone...  299.00     Electronics
12  The Fitbit Charge 4 Fitness Tracker features G...  129.95     Electronics
13  The Samsung Galaxy Watch3 features a rotating ...  399.99     Electronics
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...  349.99     Electronics
15  The Breville Barista Express Espresso Machine ...  699.95  Home & Kitchen
16  The Keurig K-Elite Coffee Maker features a str...  169.99  Home & Kitchen
17  The iRobot Roomba i7+ Robot Vacuum features au...  799.99  Home & Kitchen
18  The Ninja Foodi Digital Air Fry Oven features ...  209.99  Home & Kitchen
19  The Cuisinart ICE-70 Ice Cream Maker features ...  139.99  Home & Kitchen

                                                image
11  https://assets.bose.com/content/dam/Bose_DAM/W...
12  https://www.fitbit.com/global/content/dam/fitb...
13  https://images.samsung.com/is/image/samsung/as...
14  https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15  https://www.breville.com/content/dam/breville/...
16  https://www.keurig.com/content/dam/global-ecom...
17  https://store.irobot.com/default/i7-vacuuming-...
18  https://www.ninjakitchen.com/static/img/produc...
19  https://www.cuisinart.com/share/images/product...

In [6]:
print(df.info())

<class 'pandas.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     str
 2   description  20 non-null     str
 3   price        20 non-null     float64
 4   category     20 non-null     str
 5   image        20 non-null     str
dtypes: float64(1), int64(1), str(4)
memory usage: 1.1 KB
None

In [7]:
# Discriptive details
description = df.describe()
print(description)

             id        price
count  20.00000    20.000000
mean   10.50000   507.687000
std     5.91608   373.008199
min     1.00000   129.950000
25%     5.75000   244.237500
50%    10.50000   374.990000
75%    15.25000   724.742500
max    20.00000  1599.990000

In [8]:
print(df.shape)

(20, 6)

In [9]:
print(df.columns)

Index(['id', 'name', 'description', 'price', 'category', 'image'], dtype='str')

In [10]:
# Select specific columns of a dataframe
# Single column
print(df['name'])

0                                       Apple iPhone 12
1                                    Samsung Galaxy S21
2                                    Sony PlayStation 5
3                     LG OLED55CXPUA 55-inch 4K OLED TV
4           Bose QuietComfort 35 II Wireless Headphones
5                             Fitbit Versa 3 Smartwatch
6                                KitchenAid Stand Mixer
7                    Dyson V11 Absolute Cordless Vacuum
8                            Ninja Foodi Smart XL Grill
9                       Canon EOS Rebel T8i DSLR Camera
10                                    Apple AirPods Pro
11          Bose QuietComfort 35 II Wireless Headphones
12                      Fitbit Charge 4 Fitness Tracker
13                                Samsung Galaxy Watch3
14    Sony WH-1000XM4 Wireless Noise-Cancelling Head...
15            Breville Barista Express Espresso Machine
16                          Keurig K-Elite Coffee Maker
17                       iRobot Roomba i7+ Robot Vacuum
18                     Ninja Foodi Digital Air Fry Oven
19                     Cuisinart ICE-70 Ice Cream Maker
Name: name, dtype: str

In [11]:
# Multiple Columns
print(df[['name', 'price', 'description']])

                                                 name    price  \
0                                     Apple iPhone 12   999.00
1                                  Samsung Galaxy S21   799.00
2                                  Sony PlayStation 5   499.99
3                   LG OLED55CXPUA 55-inch 4K OLED TV  1599.99
4         Bose QuietComfort 35 II Wireless Headphones   299.00
5                           Fitbit Versa 3 Smartwatch   229.95
6                              KitchenAid Stand Mixer   399.99
7                  Dyson V11 Absolute Cordless Vacuum   699.99
8                          Ninja Foodi Smart XL Grill   279.99
9                     Canon EOS Rebel T8i DSLR Camera   899.00
10                                  Apple AirPods Pro   249.00
11        Bose QuietComfort 35 II Wireless Headphones   299.00
12                    Fitbit Charge 4 Fitness Tracker   129.95
13                              Samsung Galaxy Watch3   399.99
14  Sony WH-1000XM4 Wireless Noise-Cancelling Head...   349.99
15          Breville Barista Express Espresso Machine   699.95
16                        Keurig K-Elite Coffee Maker   169.99
17                     iRobot Roomba i7+ Robot Vacuum   799.99
18                   Ninja Foodi Digital Air Fry Oven   209.99
19                   Cuisinart ICE-70 Ice Cream Maker   139.99

                                          description
0   The Apple iPhone 12 features a 6.1-inch Super ...
1   The Samsung Galaxy S21 features a 6.2-inch Dyn...
2   The Sony PlayStation 5 features an AMD Zen 2-b...
3   The LG OLED55CXPUA 55-inch 4K OLED TV features...
4   The Bose QuietComfort 35 II Wireless Headphone...
5   The Fitbit Versa 3 Smartwatch features a built...
6   The KitchenAid Stand Mixer features a 5-quart ...
7   The Dyson V11 Absolute Cordless Vacuum feature...
8   The Ninja Foodi Smart XL Grill features 6-in-1...
9   The Canon EOS Rebel T8i DSLR Camera features a...
10  The Apple AirPods Pro feature active noise can...
11  The Bose QuietComfort 35 II Wireless Headphone...
12  The Fitbit Charge 4 Fitness Tracker features G...
13  The Samsung Galaxy Watch3 features a rotating ...
14  The Sony WH-1000XM4 Wireless Noise-Cancelling ...
15  The Breville Barista Express Espresso Machine ...
16  The Keurig K-Elite Coffee Maker features a str...
17  The iRobot Roomba i7+ Robot Vacuum features au...
18  The Ninja Foodi Digital Air Fry Oven features ...
19  The Cuisinart ICE-70 Ice Cream Maker features ...

In [12]:
custom_data = {
    "Name": ["Ayush", "Priya", "Gourish"],
    "Age": [21, 19, 20],
    "Place": ["Jahannum", "Jashpur", "Khonga"]
}

df = pd.DataFrame(custom_data)
print("\n\nSingle column")
print(df["Name"])

print("\n\nMultiple column")
print(df[["Name", "Age"]])

Single column
0      Ayush
1      Priya
2    Gourish
Name: Name, dtype: str


Multiple column
      Name  Age
0    Ayush   21
1    Priya   19
2  Gourish   20

In [13]:
print(df[(df['Age'] >= 20)])

temp = df[(df['Age'] >= 20)]
print(temp[['Name']])

      Name  Age     Place
0    Ayush   21  Jahannum
2  Gourish   20    Khonga
      Name
0    Ayush
2  Gourish

In [14]:
df = pd.read_json("./used/sample_Data.json")

df

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...
2,3,Sony PlayStation 5,The Sony PlayStation 5 features an AMD Zen 2-b...,499.99,Electronics,https://www.sony.com/image/44baa604124b770c824...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
4,5,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
5,6,Fitbit Versa 3 Smartwatch,The Fitbit Versa 3 Smartwatch features a built...,229.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
6,7,KitchenAid Stand Mixer,The KitchenAid Stand Mixer features a 5-quart ...,399.99,Home & Kitchen,https://www.kitchenaid.com/content/dam/global/...
7,8,Dyson V11 Absolute Cordless Vacuum,The Dyson V11 Absolute Cordless Vacuum feature...,699.99,Home Appliances,https://www.dysoncanada.ca/dam/dyson/images/pr...
8,9,Ninja Foodi Smart XL Grill,The Ninja Foodi Smart XL Grill features 6-in-1...,279.99,Home & Kitchen,https://www.ninjakitchen.com/medias/Ninja-OP50...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...
10,11,Apple AirPods Pro,The Apple AirPods Pro feature active noise can...,249.00,Electronics,https://www.apple.com/v/airpods-pro/b/images/m...
11,12,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
12,13,Fitbit Charge 4 Fitness Tracker,The Fitbit Charge 4 Fitness Tracker features G...,129.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
13,14,Samsung Galaxy Watch3,The Samsung Galaxy Watch3 features a rotating ...,399.99,Electronics,https://images.samsung.com/is/image/samsung/as...
14,15,Sony WH-1000XM4 Wireless Noise-Cancelling Head...,The Sony WH-1000XM4 Wireless Noise-Cancelling ...,349.99,Electronics,https://www.sony.com/image/1cdd6354c4cd21cc4f7...
15,16,Breville Barista Express Espresso Machine,The Breville Barista Express Espresso Machine ...,699.95,Home & Kitchen,https://www.breville.com/content/dam/breville/...
16,17,Keurig K-Elite Coffee Maker,The Keurig K-Elite Coffee Maker features a str...,169.99,Home & Kitchen,https://www.keurig.com/content/dam/global-ecom...
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...
18,19,Ninja Foodi Digital Air Fry Oven,The Ninja Foodi Digital Air Fry Oven features ...,209.99,Home & Kitchen,https://www.ninjakitchen.com/static/img/produc...
19,20,Cuisinart ICE-70 Ice Cream Maker,The Cuisinart ICE-70 Ice Cream Maker features ...,139.99,Home & Kitchen,https://www.cuisinart.com/share/images/product...

In [15]:
costly_items = df[(df["price"] > 500)]
costly_items.sort_values(ascending=True, by="price")

,id,name,description,price,category,image
15,16,Breville Barista Express Espresso Machine,The Breville Barista Express Espresso Machine ...,699.95,Home & Kitchen,https://www.breville.com/content/dam/breville/...
7,8,Dyson V11 Absolute Cordless Vacuum,The Dyson V11 Absolute Cordless Vacuum feature...,699.99,Home Appliances,https://www.dysoncanada.ca/dam/dyson/images/pr...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...

In [16]:
costliest_item = df.sort_values(ascending=False, by="price").head(1)
costliest_item

,id,name,description,price,category,image
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...

In [17]:
# Costliest item in home and kitchen category
home_kitchen_items = df[(df["category"] == "Home & Kitchen")]
expensive_home_kitchen_items = df[(df["category"] == "Home & Kitchen") & (df["price"] > 500)]

costliest_home_kitchen_item = home_kitchen_items.sort_values(ascending=False, by="price").head(1)
costliest_home_kitchen_item

,id,name,description,price,category,image
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...

In [18]:
custom_data = {
    "fname": ["Ayush", "Priya", "Gourish"],
    "lname": ["Singh"] * 3,
    "age": [21, 19, 20],
    "technical_marks": [89, 90, 93],
    "non_tech_marks": [98, 97, 94],
    "place": ["Jahannum", "Jashpur", "Khonga"]
}

In [19]:

df = pd.DataFrame(custom_data)

# Insert new column
# Assignment method
df["total_marks"] = df["technical_marks"] + df["non_tech_marks"]

# Using insert function
df.insert(0, "fullname", df["fname"] + " " + df["lname"])

df[["fullname", "age", "technical_marks", "non_tech_marks", "place", "total_marks"]]

        fullname  age  technical_marks  non_tech_marks     place  total_marks
0    Ayush Singh   21               89              98  Jahannum          187
1    Priya Singh   19               90              97   Jashpur          187
2  Gourish Singh   20               93              94    Khonga          187

In [20]:
# Update age of first row
df.loc[0, 'age'] = 22

df

,fullname,fname,lname,age,technical_marks,non_tech_marks,place,total_marks
0,Ayush Singh,Ayush,Singh,22,89,98,Jahannum,187
1,Priya Singh,Priya,Singh,19,90,97,Jashpur,187
2,Gourish Singh,Gourish,Singh,20,93,94,Khonga,187

In [21]:
# Update any existing column
df["total_marks"] = df["total_marks"] + 5 # Say adding grace

df

,fullname,fname,lname,age,technical_marks,non_tech_marks,place,total_marks
0,Ayush Singh,Ayush,Singh,22,89,98,Jahannum,192
1,Priya Singh,Priya,Singh,19,90,97,Jashpur,192
2,Gourish Singh,Gourish,Singh,20,93,94,Khonga,192

In [22]:
# Drop any columen or a row
# inplace = True to modify current table
df_without_redundancy = df.drop(columns=["fname", "lname"], inplace=False)
df_without_redundancy

        fullname  age  technical_marks  non_tech_marks     place  total_marks
0    Ayush Singh   22               89              98  Jahannum          192
1    Priya Singh   19               90              97   Jashpur          192
2  Gourish Singh   20               93              94    Khonga          192

## Handling missing data

In [23]:
custom_data = {
    "fname": ["Ayush", "Priya", "Gourish"],
    "lname": [None, "Singh", "Singh"],
    "age": [None, 19, 20],
    "technical_marks": [89, 90, 93],
    "non_tech_marks": [98, 97, 94],
    "place": ["Jahannum", "Jashpur", "Khonga"]
}

In [24]:
df = pd.DataFrame(custom_data)
print(df.isnull())
print("\n")
print(df.isnull().sum())

   fname  lname    age  technical_marks  non_tech_marks  place
0  False   True   True            False           False  False
1  False  False  False            False           False  False
2  False  False  False            False           False  False


fname              0
lname              1
age                1
technical_marks    0
non_tech_marks     0
place              0
dtype: int64

In [25]:
df

     fname  lname   age  technical_marks  non_tech_marks     place
0    Ayush    NaN   NaN               89              98  Jahannum
1    Priya  Singh  19.0               90              97   Jashpur
2  Gourish  Singh  20.0               93              94    Khonga

In [26]:
# Remove in first axis (axis = 0) i.e. Rows
temp_df_1 = df.dropna(axis=0, inplace=False)

# Remove in second axis (axis = 1) i.e. Column
temp_df_2 = df.dropna(axis=1, inplace=False)

In [27]:
temp_df_1

     fname  lname   age  technical_marks  non_tech_marks    place
1    Priya  Singh  19.0               90              97  Jashpur
2  Gourish  Singh  20.0               93              94   Khonga

In [28]:
temp_df_2

     fname  technical_marks  non_tech_marks     place
0    Ayush               89              98  Jahannum
1    Priya               90              97   Jashpur
2  Gourish               93              94    Khonga

### Filling the empty cells

In [29]:
df

     fname  lname   age  technical_marks  non_tech_marks     place
0    Ayush    NaN   NaN               89              98  Jahannum
1    Priya  Singh  19.0               90              97   Jashpur
2  Gourish  Singh  20.0               93              94    Khonga

In [30]:
df.fillna({"age":df['age'].mean()}, inplace=True)

     fname  lname   age  technical_marks  non_tech_marks     place
0    Ayush    NaN  19.5               89              98  Jahannum
1    Priya  Singh  19.0               90              97   Jashpur
2  Gourish  Singh  20.0               93              94    Khonga

In [31]:
df.fillna({"lname":"Unknown", "fname":"Unknown"}, inplace=True)
df

     fname    lname   age  technical_marks  non_tech_marks     place
0    Ayush  Unknown  19.5               89              98  Jahannum
1    Priya    Singh  19.0               90              97   Jashpur
2  Gourish    Singh  20.0               93              94    Khonga

In [32]:
df.loc[1, "age"] = None
df

     fname    lname   age  technical_marks  non_tech_marks     place
0    Ayush  Unknown  19.5               89              98  Jahannum
1    Priya    Singh   NaN               90              97   Jashpur
2  Gourish    Singh  20.0               93              94    Khonga

In [33]:
df['age'] = df['age'].interpolate(method="linear")
df

     fname    lname    age  technical_marks  non_tech_marks     place
0    Ayush  Unknown  19.50               89              98  Jahannum
1    Priya    Singh  19.75               90              97   Jashpur
2  Gourish    Singh  20.00               93              94    Khonga

### Interpolation

In [34]:
data = {
    "Time": [1,2,3,4,5],
    "Value": [10,None,30,None,50],
}

df = pd.DataFrame(data)
df

   Time  Value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0

In [35]:
df['Value'] = df['Value'].interpolate(method="linear")
df

   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

### Sorting and Aggregation

In [36]:
data = {
    "name": ["Arun", "Varun", "Tarun", "Karun", "Narun"],
    "age": [28, 34, 22, 34, 28],
    "salary": [27943, 78926, 89047, 16738, 37892],
}

df = pd.DataFrame(data)

In [37]:
# Sort by age
df.sort_values(by="age", ascending=True, inplace=True)
df

    name  age  salary
2  Tarun   22   89047
0   Arun   28   27943
4  Narun   28   37892
1  Varun   34   78926
3  Karun   34   16738

In [38]:
# Sort by age and salary
df.sort_values(by=["salary", "age"], ascending=[True, True], inplace=True)
df

    name  age  salary
3  Karun   34   16738
0   Arun   28   27943
4  Narun   28   37892
1  Varun   34   78926
2  Tarun   22   89047

In [39]:
# Grouping by age
salary_of_ages = df.groupby(by="age")["salary"].sum()
salary_of_ages

age
22    89047
28    65835
34    95664
Name: salary, dtype: int64

In [40]:
# Grouping by age
salary_of_ages_names = df.groupby(by=["age", "name"])["salary"].sum()
salary_of_ages_names

age  name
22   Tarun    89047
28   Arun     27943
     Narun    37892
34   Karun    16738
     Varun    78926
Name: salary, dtype: int64

### Merging and Joining

In [41]:
data1 = {
    "cust_id": [1,2,3,4, 5],
    "name": ["a", "b", "c", "d", "e"]
}

data2 = {
    "cust_id": [1,2,3,4],
    "purchased_item": [234, 345, 135, 354] 
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# df = pd.merge(df1, df2, on="column_name", how="type_of_join")
df = pd.merge(df1, df2, on="cust_id", how="left")
df

   cust_id name  purchased_item
0        1    a           234.0
1        2    b           345.0
2        3    c           135.0
3        4    d           354.0
4        5    e             NaN

 ### Concatenation

In [42]:
df_region1 = pd.DataFrame({
    "cust_id": [1,2],
    "name": ["ayush", "priya"]
})

df_region2 = pd.DataFrame({
    "cust_id": [3,4],
    "name": ["gourish", "yogesh"]
})

df = pd.concat([df_region1, df_region2], axis=0, ignore_index=True)
df

   cust_id     name
0        1    ayush
1        2    priya
2        3  gourish
3        4   yogesh

In [43]:
df = pd.concat([df_region1, df_region2], axis=1, ignore_index=False)
df

   cust_id   name  cust_id     name
0        1  ayush        3  gourish
1        2  priya        4   yogesh